[
{
    "description": "This week we cover broad term definitions for accessibility and usability, along with basic theory and practice.<br><br>For praxis, we do a heuristic evaluation, brainstorm task scenarios, and basic static HTML accessibility.",
    "reading": {
      "title": "On Average by Avery Trufelman",
      "link": "https://99percentinvisible.org/episode/on-average/"
    }
},
{
    "description": "In our second week, we examine the origins of the open web, disability rights, and subjectivity in field practice. We will also expand on types of usability testing, including analytics, surveys, individual, focus groups, contextual, first click, eye-tracking, and SUS.<br><br>Praxis will focus on accessibility auditing, and breaking down Steve Krug's test script."
},
{
    "description": "For our third week, we will dive into digital accessibility techniques, including linting, semantics, accessible content, history management, & controlling focus. Usability topics will include personas, and task analysis.<br><br>Our praxis will look at WAI-ARIA in action, and a working session for preparing scenarios."
},
{
    "description": "Our fourth week will be a working session on your mid-term assignments. This assignment will be to create a set of task scenarios, which you will run in subsequent lab sessions."
},
{
    "description": "The fifth week will cover integrating techniques into client relationship/team workflow. This includes evangelism, automation, auditing, project requirements, securing buy-in, content strategy, information architecture, wireframing & prototyping, and data evaluation.<br><br>Our praxis will include using the web with JAWS, using the mobile web with VoiceOver/TalkBack, reading analytics reports, and managing study participants."
},
{
    "description": "Our sixth week will be a time to review any theory that we determine requires revisiting, or extra material that the class has determined would be of interest. Your final assignments will be distributed this week. The assignment will be to summarize your test findings and present them to the class. Our praxis will focus on history API best practices for accessibility, being a good 'hall monitor', and on-the-fly documentation."
},
{
    "description": "In our seventh week, we will cover accessibility and state management in Vue and React, and creating and presenting usability reports."
},
{
    "description": "In our eighth and final week, you will present your final assignment to the class."
}]